In [1]:
print("Hello")

Hello

In [1]:
import pandas as pd

In [16]:
df = pd.read_csv('practice_pandas.csv')

In [17]:
df

   AREA  PRICE
0  2200  100.0
1   300    NaN
2   400  555.0
3   500  123.0
4   445  543.0

In [18]:
df.dropna()

   AREA  PRICE
0  2200  100.0
2   400  555.0
3   500  123.0
4   445  543.0

In [19]:
df['PRICE'].isna()

0    False
1     True
2    False
3    False
4    False
Name: PRICE, dtype: bool

In [20]:
import numpy as np

In [21]:
mask = df['PRICE'].isna()
df['TextValue'] = np.where(mask,'1000',df['PRICE'])

In [22]:
df

   AREA  PRICE TextValue
0  2200  100.0     100.0
1   300    NaN      1000
2   400  555.0     555.0
3   500  123.0     123.0
4   445  543.0     543.0

In [24]:
df.head(2)

   AREA  PRICE TextValue
0  2200  100.0     100.0
1   300    NaN      1000